info = True


word = "Football, Basketball"
list = word.split(", ")

print("Список №1: ",list)
while info:
    choose = int(input("Оберіть слово за ідексом (0 або 1), яке ви хочете перебрати: "+ list[0]+ " чи "+ list[1]+ ": "))

    if choose == 0:
        print("Ви обрали слово ", list[0], ":")
        for i in list[0]:
             print(i)
             info = False
    elif choose == 1:
        print("Ви обрали слово ", list[1], ":")
        for i in list[1]:
            print(i)
            info = False
    else:
        print("Ви поминилися, повторіть спробу")


# ====================================== Теорія по уроку ======================================

# word = Hello
# three_words = "Team,Fortress,Two"
# word.count(l) - порахує кількість "l" (відповідь буде 2)
# word.capitalize() - Напише першу букву з великої, коли всі інші переведе в нижній регістер (якщо буде heLLo то зробить Hello)
# word.upper() or word.lower() - upper напише слово через верхній регістер, коли lower через нижній (upper - HELLO, lower - hello)
# word.isupper() or word.islower() - isupper() якщо слово буде повністью з вернього регістра, видасть значення True, але якщо буде хоть один символ в нижньому
# видасть значення False, з islower() буде все теж саме тільки для true якщо всі букви ниднього регістра ( якщо word - HELLO, то isupper - True)
# word.find() - шукає символ, та при знаходженні видає індекс його (Наприклад word.find("e"), то відповіль буде 1, бо індекс починають рахувати з 0)
# print(three_words.split(",")) - може з одного рядка, у якому є 3 слова, зробити ліст, та розбити ці 3 слова на кожен окремий індекс
# =========================
# =========================
# можна використовувати в прикладі - напишіть свої хобі - футбол, баскетбол, волейбол - тут ми потім зможем використати split()
# для того щоб розділити рядок на 3 частини
# =========================
# =========================
# Буде відповідь ['Team', 'Fortress', 'Two']

# =============================================================================================