file = open("text.txt", "r")
# print(file.read())
for line in file:
    print(line, end="")
file.close()

text = input("Введіть текст для занесення в файл: ")

file = open("text.txt", "a")
file.write(text + "\n")
file.close()

#====================================================================================================

# func = lambda x, y: x * y
# res = func(5,2)
# print(res)


# def minimal(l):
#     min_num = l[0]
#     for el in l:
#         if el < min_num:
#             min_num = el
#     print(min_num)    


# nums1 = [5,6,3,1,5,7,8]
# minimal(nums1)

# nums2 = [5.4,6.6,4.1,2.9,3.6,8.1,1.9]
# minimal(nums2)


# def parse(x):
#     try:
#         return int(x)
#     except ValueError:
#         return x


# def summa(a,b):
    
#     return a+b

# sum1 = parse(input("Введіть 1 значення: "))
# sum2 = parse(input("Введіть 2 значення: "))
# result = summa(sum1,sum2)

# print(sum1, "+", sum2, "=", result)




# def test_func(word):
#     print(word, end="")
#     print("!")
    

# test_func("Hello")


#====================================================================================================

# new_dt = frozenset([1,2,5,7,3,3,5,4,"сто", False, 88, "OK",1231,4,43])
# print(new_dt)


# nums = [1,2,5,7,3,3,5,4]
# nums = set(nums)
# print(nums)

# # data = set("Hello")
# data = {4,3,1,2,99,1231,43}
# data.add(321)
# data.update(["сто", False, 88, "OK"])
# data.remove(1231)
# data.pop()
 
# print(data)

#====================================================================================================

# country = {"code": "UA", "name":  "Ukraine", "population": "40M"}

# # print(country.items())

# for key,value in country.items():
#     print(key, "-", value)

#====================================================================================================

# ...................................................................................................

# Варіант використання словників через функцію "dict", у такому варіанті індекси можуть бути тільки рядки, коли у звичайному варінанті через фігурні душки {}, 
# це могли бути рядки, числа, кортежі, True/False, десяткові числа

# country = dict(code="UA",name="Ukraine")
# print(country)

# ...................................................................................................

#====================================================================================================

# step1 = {"folder1": "Документи", "folder2": "Роб.Стіл", "folder3": "Ігри"}
# step2 = {"Документи": "Немає файлів", "Роб.Стіл": "Корзина", "Ігри": "Steam"}
# print("Наявні ключі: ", list(step1.keys()))
# answer = input("Обери папку (1-3): ")
# answer_folder = "folder"+answer
# if answer_folder in step1:
#     print(step2[step1[answer_folder]])
# else:
#     print("Такої папки немає")

#====================================================================================================

# country = {"code": "UA", "name": "Ukraine", "location": "Europe"}
# country = dict(code = "UA", name =  "Ukraine", location = "Europe")
# print(country["location"], country["code"], country["name"])
# print("hello\nworld")


#====================================================================================================

# Завдання 1
# Створи кортеж з 5 чисел і виведи їх суму.

# cortej = (2, 4, 6, 8, 10)

# suma_cortej = cortej[0] + cortej[1] + cortej[2] + cortej[3] + cortej[4]

# print(cortej[0], "+", cortej[1], "+", cortej[2], "+", cortej[3], "+", cortej[4], "=", suma_cortej)

# =====================

# Завдання 2
# Напиши програму, що перевіряє, чи є слово паліндромом.

# word = input("Напиши будь яке слово: ")

# if word == word[::-1]:
#     print("Паліндром!")
# else:
#     print("Не паліндром!")

# =====================

# Завдання 3
# Є кортеж чисел. Знайди мінімальне, максимальне та їх різницю (без перетворення на список).

# chislo = (3,7,5,3,11,56,332,44)
# print("Дано кортеж:", chislo)
# print("Максимальне число в кортежі:", max(chislo))
# print("Мінімальне число в кортежі:", min(chislo))
# riznisa = max(chislo) - min(chislo)
# print("Різниця чисел:", max(chislo), "-", min(chislo), "=", riznisa)

# =====================

#Завдання 4
# Створи кортеж з іменами друзів. Виведи перше та останнє ім’я.

# Friends_name = ("Егор","Ваня(Тормоз)","Денис","Максим","Ваня")
# print("Дано імена моїх друзів у кортежі:", Friends_name)
# print("Перше ім'я: ", Friends_name[0])
# print("Останнє ім'я: ", Friends_name[-1])

# =====================





#====================================================================================================

# data = (1,2,3,4,5,6,7,8,9,10)

# for el in data:
#     print(el)

# list = [11,22,33,44,55,66,77,88,99,100]

# new_data = tuple(list)
# word = "рядок"

# print(word)
# print(new_data)
# new_word = tuple(word)
# print(new_word)

#====================================================================================================

# word = "Football"

# print(word[0:8:2])


# lis = [1, 2, 5,"Python", True, 10.5]

# print(lis[0:6])
# print(lis[0:6:2])
# print(lis[-2:])
# print(lis[2:])
# print(lis[:2])
# print(lis[::2])
# print(lis[::-1])

#====================================================================================================

# info = True


# word = "Football, Basketball"
# list = word.split(", ")

# print("Список №1: ",list)
# while info:
#     choose = int(input("Оберіть слово яке ви хочете перебрати: "+ list[0]+ " чи "+ list[1]+ ": "))

#     if choose == 0:
#         print("Ви обрали слово ", list[0], ":")
#         for i in list[0]:
#              print(i)
#              info = False
#     elif choose == 1:
#         print("Ви обрали слово ", list[1], ":")
#         for i in list[1]:
#             print(i)
#             info = False
#     else:
#         print("Ви поминилися, повторіть спробу")
    

#====================================================================================================

# words= "Football, basketball, skate"

# hobby = words.split(", ")

# for i in range(len(hobby)):
#     hobby[i] = hobby[i].capitalize()

# result = ", ".join(hobby)
# print(result)


#====================================================================================================

# firstname = input("Введіть своє ім'я: ")
# lastname = input("Введіть своє прізвище: ")
# fathername = input("Введіть своє по батькове: ")

# str(print("Ваше ПІБ: ", firstname.capitalize() + " " + lastname.capitalize() + " " + fathername.capitalize()))

#====================================================================================================

# answer = str(input("Запустиш код? Y/N)"))

# if answer.upper() == "Y":
#     print("Запускається код, зачекайте...")
# else:
#     print("Добре, код не буде запущений")


# print("Твоє завдання, написати будь яких 3 слова")
# three_words = ""
# n = 0
# while n < 3:
#     three_words = str(input("Напиши слово №" + str(n+1) + ":"))
#     three_words.append() - так не можна
# print(three_words.split(","))

#====================================================================================================
#====================================================================================================
#====================================================================================================
#====================================================================================================
#====================================================================================================

# word = Hello
# three_words = "Team,Fortress,Two"
# word.count(l) - порахує кількість "l" (відповідь буде 2)
# word.capitalize() - Напише першу букву з великої, коли всі інші переведе в нижній регістер (якщо буде heLLo то зробить Hello)
# word.upper() or word.lower() - upper напише слово через верхній регістер, коли lower через нижній (upper - HELLO, lower - hello)
# word.isupper() or word.islower() - isupper() якщо слово буде повністью з вернього регістра, видасть значення True, але якщо буде хоть один символ в нижньому
# видасть значення False, з islower() буде все теж саме тільки для true якщо всі букви ниднього регістра ( якщо word - HELLO, то isupper - True)
# word.find() - шукає символ, та при знаходженні видає індекс його (Наприклад word.find("e"), то відповіль буде 1, бо індекс починають рахувати з 0)
# print(three_words.split(",")) - може з одного рядка, у якому є 3 слова, зробити ліст, та розбити ці 3 слова на кожен окремий індекс
# =========================
# =========================
# можна використовувати в прикладі - напишіть свої хобі - футбол, баскетбол, волейбол - тут ми потім зможем використати split()
# для того щоб розділити рядок на 3 частини
# =========================
# =========================
# Буде відповідь ['Team', 'Fortress', 'Two']

#====================================================================================================
#====================================================================================================
#====================================================================================================
#====================================================================================================
#====================================================================================================

# while True:
#     try:
#         num = int(input("Введіть будь яке число: "))
#     except ValueError:
#         print("Ви ввели не число, повторіть спробу")
#     if num < 0:
#          print("Число", num ,"менше за нуль")
#     elif num > 0:
#         print("Число", num ,"більше за нуль")
#     else:
#         print("Число є нульом")
#     break


#====================================================================================================

# x = int(input("Введи число: "))
# if x < 0:
#     print("Число", x ,"менше за нуль[eq[q[q[q[[q]]]]]]")
# elif x > 0:
#     print("Число", x ,"більше за нуль1111111111111111111111111111")
# else:
#     print("Число є нульомloxloxloxloxl")


#====================================================================================================


# n = int(input("Введіть довжину: "))
# user_list = []

# i = 0
# while i < n:
#     string = int(input("Додати елемент №" + str(i+1) + ": "))
#     user_list.append(string)
#     i += 1
# user_list.sort()
# print(ord(user_list))


#====================================================================================================

# nums = [1,2,3,"4",True]

# for el in nums:
#     el *= 2
#     print(el)

#====================================================================================================

# numbers = [1,2,3,4,3]
# numbers.append(False)
# numbers.insert(3,True)

# b = [3,4,5]
# numbers.extend(b)
# numbers.sort()
# # numbers.reverse() --- перевертає список, якщо було 1,2,3 то буде 3,2,1
# numbers.remove(False)
# numbers.pop()
# # numbers.clear()
# # print(numbers.count())
# print(len(numbers))

#====================================================================================================

# def add_number(num_list):
#     while True:
#         qq = (input("додайте нові числа: "))
#         try:
#             qq == int or float(qq)
#             numbers.append(qq)
#             break
#         except:
#             print("Ви ввели не число, повторіть спробу")
#     return num_list


# numbers = [2, 5, 7]
# numbers = add_number(numbers)
# print(numbers)

#====================================================================================================

# num = [2,5,7]
# while True:
#     qq = (input("додайте нові числа: "))
#     try:
#         qq == int or float(qq)
#         num.append(qq)
#         break
#     except:
#         print("Ви ввели не число, повторіть спробу")
    
# print(num)

#====================================================================================================

# list = [1,2,3,[4,5,6,[7,8,9,[10,11,12,[13,14,15]]]]]
# print(list[-1][-1][-1])

#=========================== Домашня робота з циклами for і while =========================================

# for number in range(0,101,10):
#     print(number,"%",sep="")
#     if number == 50:
#         while True:
#             answer = input("Продовжувати завантаження?: (Y/N)").lower()
#             if answer == "y":
#                 print("Продовжуємо завантаження")
#                 break
#             elif answer =="n":
#                 print("Завантаження зупинене")
#                 exit()
#             else:
#                 print("Не коректна відповідь, повторіть ще раз")

#====================================================================================================

# count = 0
# word = "Hello World!"
# for test in word:
#     print(test)
#     if test == 10:
#         print("YES!")
#     if test == "l":
#         count +=1
# print("Count:", count)

# word = input("Напиши слово: ")

# found = None
# for i in word:
#     print(i)
#     if i.lower() == "z":
#         found = True
#         break 
    
# else:
#     found = False

# if found == True:
#     print("Стоп, так ти ж ебаний зетнік, йди нахуй звідси")
# else:
#     print("ти пройшов провірку")



# ==========================================================

# for q in range(1, 11):
#     if q >5:
#         break
    
#     if q % 2 == 0:
#         continue

#     print(q)

# ==========================================================

# word = input("напиши будь яке слово: ")
# letter_z = False

# for test in word:
#     print(test)
#     if test == "Z" or test == "z":
#         letter_z = True
#         break

# if letter_z:
#     print("Ти зетнік, вбийся чмо >:(")
# else:
#     print("Ти не зетнік :)")

# ==========================================================

# dow = "Завантаження проєкту! "
# print(dow)
# for num in range(0, 101, 10):
#     print(num,"%",sep="")