# =====================

# Завдання 1
# Створи кортеж з 5 чисел і виведи їх суму.

cortej = (2, 4, 6, 8, 10)

suma_cortej = cortej[0] + cortej[1] + cortej[2] + cortej[3] + cortej[4]

print(cortej[0], "+", cortej[1], "+", cortej[2], "+", cortej[3], "+", cortej[4], "=", suma_cortej)

# =====================

# Завдання 2
# Напиши програму, що перевіряє, чи є слово паліндромом.

word = input("Напиши будь яке слово: ")

if word == word[::-1]:
    print("Паліндром!")
else:
    print("Не паліндром!")

# =====================

# Завдання 3
# Є кортеж чисел. Знайди мінімальне, максимальне та їх різницю (без перетворення на список).

chislo = (3,7,5,3,11,56,332,44)
print("Дано кортеж:", chislo)
print("Максимальне число в кортежі:", max(chislo))
print("Мінімальне число в кортежі:", min(chislo))
riznisa = max(chislo) - min(chislo)
print("Різниця чисел:", max(chislo), "-", min(chislo), "=", riznisa)

# =====================

#Завдання 4
# Створи кортеж з іменами друзів. Виведи перше та останнє ім’я.

Friends_name = ("Егор","Ваня(Тормоз)","Денис","Максим","Ваня")
print("Дано імена моїх друзів у кортежі:", Friends_name)
print("Перше ім'я: ", Friends_name[0])
print("Останнє ім'я: ", Friends_name[-1])

# =====================